# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P2-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, RepVGGBlock, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128,True]]
  - [-1, 1, GatedFFN, [128,True]]
  - [-1, 1, RepVGGBlock, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256,True]]
  - [-1, 1, HCFDA, [256]]
  - [-1, 1, GatedFFN, [256,True]]
  - [-1, 1, RepVGGBlock, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [ -1, 1, HCFDA, [512] ]
  - [-1, 1, RepVGGBlock, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 13

# YOLOv8.0-p2 head
head:

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  #10
  - [5, 1, DWPWConv, [128, 3, 2]] ################################## p3深度可分离卷积层后(v8s是c=64/k=3/s=2/p=1)
  - [[-1, 9, 14], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 17


  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [2, 1, DWPWConv, [64, 3, 2]] ################################## p2深度可分离卷积层加入融合(v8s是c=32/k=3/s=2/p=1)
  - [[-1, 5, 18], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256,True]]  # 17 (P3/8-small)
  - [ -1, 1, HCFDA, [256]]


  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [0, 1, DWPWConv, [32, 3, 2]] ################################## p1深度可分离卷积层加入融合(v8s是c=16/k=3/s=2/p=1)
  - [[-1, 2, 23], 1, Concat, [1]]  # cat backbone P2
  - [-1, 3, C2f, [128,True]]  # 21 (P2/4-xsmall)

  - [-1, 1, DWPWConv, [128, 3, 2]]
  - [[-1, 21], 1, Concat, [1]]  # cat head P3
  - [-1, 3,C2f, [256,True]]  # 24 (P3/8-small)

  - [-1, 1, DWPWConv, [256, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 27 (P4/16-medium)

  - [-1, 1, DWPWConv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 30 (P5/32-large)

  - [[26, 29, 32,35], 1, Detect, [nc]]  # Detect(P2, P3, P4, P5)
